Revit 2027 API
PlasticVinyl.PlasticvinylPattern Property
 The property labeled "Relief Pattern" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string PlasticvinylPattern { get; }
Public Shared ReadOnly Property PlasticvinylPattern As String
	Get
public:
static property String^ PlasticvinylPattern {
	String^ get ();
}
static member PlasticvinylPattern : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylPatternType".
See Also
Reference
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace